package com.adodooo.codequery.common;

import java.util.HashMap;
import java.util.Map;

import com.dreammore.framework.common.utils.Tools;

public final class RegionUtil {
	
	public final static String[] PLACE_NAMES = new String[]{
		"北京市", "北京",
		"天津市", "天津",
		"河北省", "河北",
		"山西省", "山西",
		"内蒙古自治区", "内蒙古",
		"辽宁省", "辽宁",
		"吉林省", "吉林",
		"黑龙江省", "黑龙江",
		"上海市", "上海",
		"江苏省", "江苏",
		"浙江省", "浙江",
		"安徽省", "安徽",
		"福建省", "福建",
		"江西省", "江西",
		"山东省", "山东",
		"河南省", "河南",
		"湖北省", "湖北",
		"湖南省", "湖南",
		"广东省", "广东",
		"广西壮族自治区", "广西",
		"海南省", "海南",
		"重庆市", "重庆",
		"四川省", "四川",
		"贵州省", "贵州",
		"云南省", "云南",
		"西藏自治区", "西藏",
		"陕西省", "陕西",
		"甘肃省", "甘肃",
		"青海省", "青海",
		"宁夏回族自治区", "宁夏",
		"新疆维吾尔自治区", 	"新疆",
		"台湾省", "台湾",
		"香港特别行政区", "香港",
		"澳门特别行政区", "澳门",
	};
	
	public final static Map<String, String> PLACE_MAP = new HashMap<String, String>() {
		{
			put("北京市","110000");
			put("北京","110000");
			put("天津市","120000");
			put("天津","120000");
			put("河北省","130000");
			put("河北","130000");
			put("山西省","140000");
			put("山西","140000");
			put("内蒙古自治区","150000");
			put("内蒙古","150000");
			put("辽宁省","210000");
			put("辽宁","210000");
			put("吉林省","220000");
			put("吉林","220000");
			put("黑龙江省","230000");
			put("黑龙江","230000");
			put("上海市","310000");
			put("上海","310000");
			put("江苏省","320000");
			put("江苏","320000");
			put("浙江省","330000");
			put("浙江","330000");
			put("安徽省","340000");
			put("安徽","340000");
			put("福建省","350000");
			put("福建","350000");
			put("江西省","360000");
			put("江西","360000");
			put("山东省","370000");
			put("山东","370000");
			put("河南省","410000");
			put("河南","410000");
			put("湖北省","420000");
			put("湖北","420000");
			put("湖南省","430000");
			put("湖南","430000");
			put("广东省","440000");
			put("广东","440000");
			put("广西壮族自治区","450000");
			put("广西","450000");
			put("海南省","460000");
			put("海南","460000");
			put("重庆市","500000");
			put("重庆","500000");
			put("四川省","510000");
			put("四川","510000");
			put("贵州省","520000");
			put("贵州","520000");
			put("云南省","530000");
			put("云南","530000");
			put("西藏自治区","540000");
			put("西藏","540000");
			put("陕西省","610000");
			put("陕西","610000");
			put("甘肃省","620000");
			put("甘肃","620000");
			put("青海省","630000");
			put("青海","630000");
			put("宁夏回族自治区","640000");
			put("宁夏","640000");
			put("新疆维吾尔自治区","650000");
			put("新疆","650000");
			put("台湾省","710000");
			put("台湾","710000");
			put("香港特别行政区","810000");
			put("香港","810000");
			put("澳门特别行政区","820000");
			put("澳门","820000");
		}
	};
	
	public static String getRegion(String srcRegion) {
		if (Tools.empty(srcRegion)) {
			return null;
		}
		for(int i = 0, length = PLACE_NAMES.length ; i < length; i++) {
			if (srcRegion.indexOf(PLACE_NAMES[i]) >= 0) {
				return PLACE_NAMES[i];
			}
		}
		return null;
	}
	
	public static void main(String[] args) {
		System.out.println(PLACE_MAP.get("香港特别行政区"));
		System.err.println(getRegion("新疆阿克苏地区阿克苏市"));
		System.err.println(PLACE_MAP.get(getRegion("新疆阿克苏地区阿克苏市")));
	}

}
